reversing/challenge9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 9</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenge 9</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5f8cd1e">1. Original assembly</a></li>
<li><a href="#org212901f">2. C translation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5f8cd1e" class="outline-2">
<h2 id="org5f8cd1e"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-1">
<p>
Original challenge link: <a href="https://challenges.re/9/">Click me</a>.
</p>

<p>
Even the author says that this challenge is quite easy, so I won't make any
assembly notes for this one.
</p>

<p>
This challenge only included the used labels, so I only had to make some minor
changes to fit the <a href="https://nasm.us/">nasm</a> syntax.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">.LC0</span>:
    <span style="color: #4ae2ff;">.string</span> <span style="color: #00d3d0;">"error!"</span>
<span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">sub</span> <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">8</span>
    <span style="color: #feacd0;">movzx</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">BYTE</span> [<span style="color: #6ae4b9;">rdi</span>]
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">al</span>, <span style="color: #88ca9f;">89</span>
    <span style="color: #feacd0;">je</span>  .L3
    <span style="color: #feacd0;">jle</span> .L21
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">al</span>, <span style="color: #88ca9f;">110</span>
    <span style="color: #feacd0;">je</span>  .L6
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">al</span>, <span style="color: #88ca9f;">121</span>
    <span style="color: #feacd0;">jne</span> .L2
<span style="color: #4ae2ff;">.L3</span>:
    <span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">1</span>
    <span style="color: #feacd0;">add</span> <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">8</span>
    <span style="color: #feacd0;">ret</span>
<span style="color: #4ae2ff;">.L21</span>:
    <span style="color: #feacd0;">cmp</span> <span style="color: #6ae4b9;">al</span>, <span style="color: #88ca9f;">78</span>
    <span style="color: #feacd0;">je</span>  .L6
<span style="color: #4ae2ff;">.L2</span>:
    <span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">edi</span>, .LC0
    <span style="color: #feacd0;">call</span>    puts
    <span style="color: #feacd0;">xor</span> <span style="color: #6ae4b9;">edi</span>, <span style="color: #6ae4b9;">edi</span>
    <span style="color: #feacd0;">call</span>    exit
<span style="color: #4ae2ff;">.L6</span>:
    <span style="color: #feacd0;">xor</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
    <span style="color: #feacd0;">add</span> <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">8</span>
    <span style="color: #feacd0;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org212901f" class="outline-2">
<h2 id="org212901f"><span class="section-number-2">2.</span> C translation</h2>
<div class="outline-text-2" id="text-2">
<p>
Literal translation preserving the branching.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">void</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">str</span>) {
    <span style="color: #ff6f9f;">if</span> (*str == <span style="color: #00d3d0;">'Y'</span>) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L3</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">1</span>;
    } <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (*str &lt; <span style="color: #00d3d0;">'Y'</span>) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L21</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">if</span> (*str == <span style="color: #00d3d0;">'N'</span>) {
            <span style="color: #989898;">/* </span><span style="color: #989898;">.L6</span><span style="color: #989898;"> */</span>
            <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
        }
    } <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (*str == <span style="color: #00d3d0;">'n'</span>) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L6</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
    } <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (*str != <span style="color: #00d3d0;">'y'</span>) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L2</span><span style="color: #989898;"> */</span>
        puts(<span style="color: #00d3d0;">"error!"</span>);
        exit(<span style="color: #88ca9f;">0</span>);
    } <span style="color: #ff6f9f;">else</span> {
        <span style="color: #989898;">/* </span><span style="color: #989898;">.L3</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">1</span>;
    }
}
</pre>
</div>

<p>
Simplified into this.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">void</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">str</span>) {
    <span style="color: #ff6f9f;">if</span> (*str == <span style="color: #00d3d0;">'Y'</span> || *str == <span style="color: #00d3d0;">'y'</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">1</span>;

    <span style="color: #ff6f9f;">if</span> (*str == <span style="color: #00d3d0;">'N'</span> || *str == <span style="color: #00d3d0;">'n'</span>)
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;

    puts(<span style="color: #00d3d0;">"error!"</span>);
    exit(<span style="color: #88ca9f;">0</span>);
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
